{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PER",
    "2": "I-PER",
    "3": "B-PHONE",
    "4": "I-PHONE",
    "5": "B-PASSPORT",
    "6": "I-PASSPORT",
    "7": "B-SNILS",
    "8": "I-SNILS",
    "9": "B-EMAIL",
    "10": "I-EMAIL",
    "11": "B-ADDRESS",
    "12": "I-ADDRESS",
    "13": "B-INN",
    "14": "I-INN",
    "15": "B-BIRTHDATE",
    "16": "I-BIRTHDATE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ADDRESS": 11,
    "B-BIRTHDATE": 15,
    "B-EMAIL": 9,
    "B-INN": 13,
    "B-PASSPORT": 5,
    "B-PER": 1,
    "B-PHONE": 3,
    "B-SNILS": 7,
    "I-ADDRESS": 12,
    "I-BIRTHDATE": 16,
    "I-EMAIL": 10,
    "I-INN": 14,
    "I-PASSPORT": 6,
    "I-PER": 2,
    "I-PHONE": 4,
    "I-SNILS": 8,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
